{"data":{"type":"contents","id":"themes","attributes":{"html":"<p>Ember Ghost currently only supports 2 themes, the default <a href=\"https://github.com/stonecircle/ember-ghost-casper-template\">Casper template</a> and the <a href=\"https://github.com/stonecircle/ember-ghost-attila-template\">Attila template</a>. If you want to swap between templates it is as simple as installing a different npm dependency 🎉</p>\n<p>The <a href=\"https://github.com/stonecircle/ember-ghost/blob/master/README.md\">Ember Ghost documentation</a> recommends that you use the default theme called Casper, which is designed to be a clean, readable publication layout and can be easily adapted for most purposes. The ember-ghost-casper-template is a direct fork of Ghost's official Casper repository so it aims to be as close as possible to the original.</p>\n<p>If you are interested in writing your own theme for Ember Ghost please <a href=\"https://stonecircle.io\">reach out to us</a> and we can walk you through the process. Hopefully if there is enough interest we can provide basic instructions on how to build your own theme using this system. As Ghost uses handlebars it is not too difficult to port an existing template to use Ember templates, so if you have any requests please let us know 👍</p>","content":"\nEmber Ghost currently only supports 2 themes, the default [Casper template](https://github.com/stonecircle/ember-ghost-casper-template) and the [Attila template](https://github.com/stonecircle/ember-ghost-attila-template). If you want to swap between templates it is as simple as installing a different npm dependency 🎉\n\nThe [Ember Ghost documentation](https://github.com/stonecircle/ember-ghost/blob/master/README.md) recommends that you use the default theme called Casper, which is designed to be a clean, readable publication layout and can be easily adapted for most purposes. The ember-ghost-casper-template is a direct fork of Ghost's official Casper repository so it aims to be as close as possible to the original.\n\nIf you are interested in writing your own theme for Ember Ghost please [reach out to us](https://stonecircle.io) and we can walk you through the process. Hopefully if there is enough interest we can provide basic instructions on how to build your own theme using this system. As Ghost uses handlebars it is not too difficult to port an existing template to use Ember templates, so if you have any requests please let us know 👍\n","title":"Setting up your own Ghost theme","date":"Tue Jun 12 2018 17:49:21 GMT+0100 (IST)","featured":true,"image":"/images/design.jpg","imageMeta":{"attribution":null,"attributionLink":null},"tags":["getting-started"]},"relationships":{"author":{"data":{"type":"authors","id":"ghost"}}}}}